In [1]:
import pandas as pd
import os

In [ ]:
#DELIVERABLE 1:  COLLECT THE DATA

In [2]:
student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [3]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [ ]:
#DELIVERABLE 2:  PREPARE THE DATA

In [4]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
student_df.duplicated().sum()

1836

In [7]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [8]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [10]:
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [11]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [ ]:
#DELIVERABLE 3:  SUMMARIZE THE DATA

In [12]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [13]:
student_df.mean()

/var/folders/21/fw5h2mmn3rzcdw_y8vdpxljw0000gp/T/ipykernel_26364/1456962452.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  student_df.mean()

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [26]:
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [ ]:
#DELIVERABLE 4:  DRILL DOWN INTO THE DATA

In [15]:
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [16]:
student_df.iloc[0:3, [3, 4, 5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [17]:
student_df.iloc[0:4]

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918

In [18]:
student_df.iloc[0:4].describe()

         student_id  grade  reading_score  math_score  school_budget
count  4.000000e+00    4.0       4.000000    4.000000       4.000000
mean   6.413950e+07    9.0      78.100000   78.100000  917530.500000
std    2.775381e+07    0.0      16.630695    7.901477   69933.485563
min    4.502490e+07    9.0      59.000000   70.400000  846745.000000
25%    4.505854e+07    9.0      67.025000   72.725000  864436.750000
50%    5.382612e+07    9.0      79.350000   76.900000  915729.500000
75%    7.290708e+07    9.0      90.425000   82.275000  968823.250000
max    1.038808e+08    9.0      94.700000   88.200000  991918.000000

In [19]:
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [20]:
student_df.loc[student_df["school_name"] == "Dixon High School", ["reading_score", "grade"]]

       reading_score  grade
1               94.7      9
32              90.3     12
45              71.1     10
58              83.5      9
60              59.5     10
...              ...    ...
19401           62.1      9
19435           61.0      9
19445           43.9     10
19466           95.2     12
19477           69.8      9

[1583 rows x 2 columns]

In [21]:
avg_student_scores_by_grade = student_df.groupby(by='grade').mean()
avg_student_scores_by_grade.loc[:, ["reading_score"]]

       reading_score
grade
9          69.236713
10         71.647590
11         77.478417
12         72.245103

In [ ]:
#DELIVERABLE 5: COMPARE THE DATA

In [22]:
avg_student_scores_by_grade = student_df.groupby(by='school_type').mean()
avg_student_scores_by_grade.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [23]:
count_by_school = student_df.groupby(by='school_name').min()

In [24]:
count_by_school.loc[:, ["student_count"]].sort_values("student_count")

KeyError: "None of [Index(['student_count'], dtype='object')] are in the [columns]"

In [25]:
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319

In [ ]:
#DELIVERABLE 6:  REPORT FINDINGS

In [ ]:
After the analysis, I believe the appropriate analysis was performed.  However, an idea to provide a bigger picture, we can aggregate the data by school name, and then by grade, and calculate the average reading score and the average math score rather than just the math school based on school type.